In [3]:
import pandas as pd

In [7]:
import numpy as np

In [15]:
(pd.Series([1,2,3,4,5]))

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [24]:
data = pd.Series([1,2,3,4,5],index = ["a", "b", "c", "d", "e"])
data

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [26]:
data.name = "Numbers"

In [46]:
data.shape

(5,)

In [48]:
data.values

array([1, 2, 3, 4, 5], dtype=int64)

In [52]:
data["a"],data["b"]

(1, 2)

In [54]:
data.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [76]:
data.loc["a"::2],data.iloc[3]

(a    1
 c    3
 e    5
 Name: Numbers, dtype: int64,
 4)

In [80]:
### data Frames

In [92]:
dictionary = {
    "usn":[83,90,68],
    "name":["lav","manasa","jayanthi"],
    "age":[21,60,22],
    "branch":["cse","cse","cse"],
}

In [94]:
df = pd.DataFrame(dictionary)
df

   usn      name  age branch
0   83       lav   21    cse
1   90    manasa   60    cse
2   68  jayanthi   22    cse

In [106]:
data = pd.read_csv(r"C:\Users\avlav\OneDrive\Desktop\sample.csv")
data

,Unnamed: 0,EmpID,Name,Department,Age,Salary,Experience,JoiningDate,City,PerformanceScore
0,0,101,Ram,IT,25,50000,2,2021-01-15,Bangalore,4.5
1,1,102,Shyam,HR,30,45000,5,2019-03-10,Mumbai,3.8
2,2,103,Geeta,Finance,28,60000,4,2020-07-22,Delhi,4.2
3,3,104,Anita,IT,35,75000,10,2015-09-30,Bangalore,4.9
4,4,105,Kiran,HR,32,52000,7,2018-06-12,Mumbai,4.1
5,5,106,John,Finance,29,58000,3,2021-11-05,Delhi,3.9
6,6,107,Meena,IT,41,82000,15,2010-04-18,Bangalore,4.8
7,7,108,David,HR,26,48000,2,2022-02-14,Mumbai,3.7
8,8,109,Sara,Finance,38,61000,12,2013-12-01,Delhi,4.3
9,9,110,Arjun,IT,27,54000,4,2020-08-19,Bangalore,4.0
10,10,111,Ravi,HR,33,47000,6,2017-05-23,Mumbai,3.6
11,11,112,Priya,Finance,31,59000,5,2019-09-17,Delhi,4.4
12,12,113,Kunal,IT,45,90000,18,2008-03-11,Bangalore,4.9
13,13,114,Sneha,HR,29,51000,3,2021-07-29,Mumbai,3.5
14,14,115,Vijay,Finance,36,62000,11,2014-01-10,Delhi,4.2
15,15,116,Neha,IT,40,88000,14,2011-10-21,Bangalore,4.7
16,16,117,Amit,HR,34,53000,8,2016-04-05,Mumbai,4.0
17,17,118,Pooja,Finance,30,57000,6,2018-12-12,Delhi,4.1
18,18,119,Rahul,IT,28,56000,4,2020-02-28,Bangalore,3.9
19,19,120,Divya,HR,37,49500,9,2015-06-30,Mumbai,4.3

In [108]:
data.head()

,Unnamed: 0,EmpID,Name,Department,Age,Salary,Experience,JoiningDate,City,PerformanceScore
0,0,101,Ram,IT,25,50000,2,2021-01-15,Bangalore,4.5
1,1,102,Shyam,HR,30,45000,5,2019-03-10,Mumbai,3.8
2,2,103,Geeta,Finance,28,60000,4,2020-07-22,Delhi,4.2
3,3,104,Anita,IT,35,75000,10,2015-09-30,Bangalore,4.9
4,4,105,Kiran,HR,32,52000,7,2018-06-12,Mumbai,4.1

In [110]:
data.tail()

,Unnamed: 0,EmpID,Name,Department,Age,Salary,Experience,JoiningDate,City,PerformanceScore
15,15,116,Neha,IT,40,88000,14,2011-10-21,Bangalore,4.7
16,16,117,Amit,HR,34,53000,8,2016-04-05,Mumbai,4.0
17,17,118,Pooja,Finance,30,57000,6,2018-12-12,Delhi,4.1
18,18,119,Rahul,IT,28,56000,4,2020-02-28,Bangalore,3.9
19,19,120,Divya,HR,37,49500,9,2015-06-30,Mumbai,4.3

In [112]:
data.describe()

,Unnamed: 0,EmpID,Age,Salary,Experience,PerformanceScore
count,20.00000,20.00000,20.000000,20.000000,20.000000,20.000000
mean,9.50000,110.50000,32.700000,59875.000000,7.400000,4.190000
std,5.91608,5.91608,5.449288,13388.796377,4.615762,0.415363
min,0.00000,101.00000,25.000000,45000.000000,2.000000,3.500000
25%,4.75000,105.75000,28.750000,50750.000000,4.000000,3.900000
50%,9.50000,110.50000,31.500000,56500.000000,6.000000,4.150000
75%,14.25000,115.25000,36.250000,61250.000000,10.250000,4.425000
max,19.00000,120.00000,45.000000,90000.000000,18.000000,4.900000

In [116]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Unnamed: 0        20 non-null     int64
 1   EmpID             20 non-null     int64
 2   Name              20 non-null     object
 3   Department        20 non-null     object
 4   Age               20 non-null     int64
 5   Salary            20 non-null     int64
 6   Experience        20 non-null     int64
 7   JoiningDate       20 non-null     object
 8   City              20 non-null     object
 9   PerformanceScore  20 non-null     float64
dtypes: float64(1), int64(5), object(4)
memory usage: 1.7+ KB

In [120]:
data.shape

(20, 10)

In [122]:
data.sample()

,Unnamed: 0,EmpID,Name,Department,Age,Salary,Experience,JoiningDate,City,PerformanceScore
2,2,103,Geeta,Finance,28,60000,4,2020-07-22,Delhi,4.2

In [126]:
data.Name

0       Ram
1     Shyam
2     Geeta
3     Anita
4     Kiran
5      John
6     Meena
7     David
8      Sara
9     Arjun
10     Ravi
11    Priya
12    Kunal
13    Sneha
14    Vijay
15     Neha
16     Amit
17    Pooja
18    Rahul
19    Divya
Name: Name, dtype: object

In [130]:
data[["Name","Department","Salary"]]

     Name Department  Salary
0     Ram         IT   50000
1   Shyam         HR   45000
2   Geeta    Finance   60000
3   Anita         IT   75000
4   Kiran         HR   52000
5    John    Finance   58000
6   Meena         IT   82000
7   David         HR   48000
8    Sara    Finance   61000
9   Arjun         IT   54000
10   Ravi         HR   47000
11  Priya    Finance   59000
12  Kunal         IT   90000
13  Sneha         HR   51000
14  Vijay    Finance   62000
15   Neha         IT   88000
16   Amit         HR   53000
17  Pooja    Finance   57000
18  Rahul         IT   56000
19  Divya         HR   49500

In [132]:
data[["Name","Department","Salary"]].head(2)

    Name Department  Salary
0    Ram         IT   50000
1  Shyam         HR   45000

In [134]:
type((data.Name))

pandas.core.series.Series

In [254]:
data = pd.read_csv(r"C:\Users\avlav\OneDrive\Desktop\test2.csv")
data

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David   NaN         IT  62000.0
4           4      Eve  29.0         HR      NaN
5           5    Alice  25.0         HR  50000.0

In [142]:
data.isnull().sum()

Unnamed: 0    0
Name          0
Age           1
Department    0
Salary        1
dtype: int64

In [148]:
data.isnull()

   Unnamed: 0   Name    Age  Department  Salary
0       False  False  False       False   False
1       False  False  False       False   False
2       False  False  False       False   False
3       False  False   True       False   False
4       False  False  False       False    True
5       False  False  False       False   False

In [154]:
data

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David   NaN         IT  62000.0
4           4      Eve  29.0         HR      NaN
5           5    Alice  25.0         HR  50000.0

In [160]:
data.loc[:,"Name": "Salary"]

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [162]:
data.loc[1:3,"Name":"Department"]

      Name   Age Department
1      Bob  30.0         IT
2  Charlie  35.0    Finance
3    David   NaN         IT

In [164]:
data.loc[3:,"Age":"Salary"]

    Age Department   Salary
3   NaN         IT  62000.0
4  29.0         HR      NaN
5  25.0         HR  50000.0

In [172]:
data.iloc[1:4,1:4]

      Name   Age Department
1      Bob  30.0         IT
2  Charlie  35.0    Finance
3    David   NaN         IT

In [178]:
data.columns

Index(['Unnamed: 0', 'Name', 'Age', 'Department', 'Salary'], dtype='object')

In [252]:
data.rename(columns={"Name":"N","Age":"A","Department":"D","Salary":"S"},inplace=True)
data

         N     A        D        S  updated_S  updated_S2  updated_S3
0    Alice  25.0       HR  50000.0    60000.0     60000.0     60000.0
1      Bob  30.0       IT  60000.0    70000.0     70000.0     70000.0
2  Charlie  35.0  Finance  70000.0    80000.0     80000.0     80000.0
3    David   NaN       IT  62000.0    72000.0     72000.0     72000.0
4      Eve  29.0       HR      NaN        NaN         NaN         NaN
5    Alice  25.0       HR  50000.0    60000.0     60000.0     60000.0

In [194]:
data.drop('Unnamed: 0',axis=1,inplace=True)
data

         N     A        D        S
0    Alice  25.0       HR  50000.0
1      Bob  30.0       IT  60000.0
2  Charlie  35.0  Finance  70000.0
3    David   NaN       IT  62000.0
4      Eve  29.0       HR      NaN
5    Alice  25.0       HR  50000.0

In [200]:
data["updated_S"]=data["S"]+5000
data

         N     A        D        S  updated_S
0    Alice  25.0       HR  50000.0    55000.0
1      Bob  30.0       IT  60000.0    65000.0
2  Charlie  35.0  Finance  70000.0    75000.0
3    David   NaN       IT  62000.0    67000.0
4      Eve  29.0       HR      NaN        NaN
5    Alice  25.0       HR  50000.0    55000.0

In [222]:
data["updated_S2"]=data["S"].map(lambda x:x+10000)
data

         N     A        D        S  updated_S  updated_S2  updated_S3
0    Alice  25.0       HR  50000.0    60000.0     60000.0     60000.0
1      Bob  30.0       IT  60000.0    70000.0     70000.0     70000.0
2  Charlie  35.0  Finance  70000.0    80000.0     80000.0     80000.0
3    David   NaN       IT  62000.0    72000.0     72000.0     72000.0
4      Eve  29.0       HR      NaN        NaN         NaN         NaN
5    Alice  25.0       HR  50000.0    60000.0     60000.0     60000.0

In [224]:
data.dropna()

         N     A        D        S  updated_S  updated_S2  updated_S3
0    Alice  25.0       HR  50000.0    60000.0     60000.0     60000.0
1      Bob  30.0       IT  60000.0    70000.0     70000.0     70000.0
2  Charlie  35.0  Finance  70000.0    80000.0     80000.0     80000.0
5    Alice  25.0       HR  50000.0    60000.0     60000.0     60000.0

In [240]:
data.isnull().sum()

N             0
A             1
D             0
S             1
updated_S     1
updated_S2    1
updated_S3    1
dtype: int64

In [256]:
data

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David   NaN         IT  62000.0
4           4      Eve  29.0         HR      NaN
5           5    Alice  25.0         HR  50000.0

In [262]:
data[data["Age"]>25]

   Unnamed: 0     Name   Age Department   Salary
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
4           4      Eve  29.0         HR      NaN

In [268]:
data.isnull().sum()

Unnamed: 0    0
Name          0
Age           1
Department    0
Salary        1
dtype: int64

In [272]:
data["Age"]

0    25.0
1    30.0
2    35.0
3     NaN
4    29.0
5    25.0
Name: Age, dtype: float64

In [284]:
data["Age"] = data["Age"].fillna(value=data["Age"].mean())
data["Salary"] = data["Salary"].fillna(value=data["Salary"].mean())

In [278]:
data

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David  28.8         IT  62000.0
4           4      Eve  29.0         HR      NaN
5           5    Alice  25.0         HR  50000.0

In [288]:
data["Department"].value_counts()

Department
HR         3
IT         2
Finance    1
Name: count, dtype: int64

In [290]:
data["Age"] = data["Age"].fillna(method="ffill")
data["Salary"] = data["Salary"].fillna(method="ffill")

C:\Users\avlav\AppData\Local\Temp\ipykernel_524\2656616875.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data["Age"] = data["Age"].fillna(method="ffill")
C:\Users\avlav\AppData\Local\Temp\ipykernel_524\2656616875.py:2: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data["Salary"] = data["Salary"].fillna(method="ffill")

In [296]:
data.Age.ffill()

0    25.0
1    30.0
2    35.0
3    28.8
4    29.0
5    25.0
Name: Age, dtype: float64

In [298]:
data

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David  28.8         IT  62000.0
4           4      Eve  29.0         HR  58400.0
5           5    Alice  25.0         HR  50000.0

In [302]:
## columns wise applay
data["updated_salary"] = data["Salary"].apply(lambda x:x+500)

In [304]:
data

   Unnamed: 0     Name   Age Department   Salary  updated_salary
0           0    Alice  25.0         HR  50000.0         50500.0
1           1      Bob  30.0         IT  60000.0         60500.0
2           2  Charlie  35.0    Finance  70000.0         70500.0
3           3    David  28.8         IT  62000.0         62500.0
4           4      Eve  29.0         HR  58400.0         58900.0
5           5    Alice  25.0         HR  50000.0         50500.0

In [306]:
##rows wise apply
data["level"] = data.apply(lambda row:"High" if row["Salary"] > 60000 else "Low",axis=1)

In [308]:
data

   Unnamed: 0     Name   Age Department   Salary  updated_salary level
0           0    Alice  25.0         HR  50000.0         50500.0   Low
1           1      Bob  30.0         IT  60000.0         60500.0   Low
2           2  Charlie  35.0    Finance  70000.0         70500.0  High
3           3    David  28.8         IT  62000.0         62500.0  High
4           4      Eve  29.0         HR  58400.0         58900.0   Low
5           5    Alice  25.0         HR  50000.0         50500.0   Low

In [312]:
data.groupby("Department")["Salary"].mean()

Department
Finance    70000.0
HR         52800.0
IT         61000.0
Name: Salary, dtype: float64

In [342]:
filtered = data[(data["Age"] > 28) & (data["Department"] == "IT")]

In [344]:
filtered

   Unnamed: 0   Name   Age Department   Salary  updated_salary level
1           1    Bob  30.0         IT  60000.0         60500.0   Low
3           3  David  28.8         IT  62000.0         62500.0  High

In [346]:
#### Task 1

In [348]:
import pandas as pd

# 1) Create a Series with custom labels
products = pd.Series([700, 150, 300],
                     index=["Laptop", "Mouse", "Keyboard"])

# 2) Access price of 'Laptop' (label-based indexing)
laptop_price = products["Laptop"]

# 3) Slice first two products (positional indexing)
first_two = products.iloc[0:2]

# 4) Print results
print("Full Series:\n", products)
print("\nPrice of Laptop:", laptop_price)
print("\nFirst two products:\n", first_two)

Full Series:
 Laptop      700
Mouse       150
Keyboard    300
dtype: int64

Price of Laptop: 700

First two products:
 Laptop    700
Mouse     150
dtype: int64

In [350]:
#### Task 2

In [352]:
import pandas as pd

# 1) Create the Series
grades = pd.Series([85, None, 92, 45, None, 78, 55])

# 2) Identify missing values
print("Missing values:\n", grades.isnull())

# 3) Fill missing values with 0
filled_grades = grades.fillna(0)

# 4) Boolean masking: scores > 60
passed = filled_grades[filled_grades > 60]

# 5) Print results
print("\nOriginal Series:\n", grades)
print("\nFilled Series:\n", filled_grades)
print("\nScores > 60:\n", passed)

Missing values:
 0    False
1     True
2    False
3    False
4     True
5    False
6    False
dtype: bool

Original Series:
 0    85.0
1     NaN
2    92.0
3    45.0
4     NaN
5    78.0
6    55.0
dtype: float64

Filled Series:
 0    85.0
1     0.0
2    92.0
3    45.0
4     0.0
5    78.0
6    55.0
dtype: float64

Scores > 60:
 0    85.0
2    92.0
5    78.0
dtype: float64

In [354]:
### Task 3

In [356]:
import pandas as pd

# 1) Create the Series
usernames = pd.Series([' Alice ', 'bOB', ' Charlie_Data ', 'daisy'])

# 2) Clean the text
cleaned = usernames.str.strip().str.lower()

# 3) Check which names contain 'a'
contains_a = cleaned.str.contains('a')

# 4) Print results
print("Cleaned Usernames:\n", cleaned)
print("\nContains letter 'a':\n", contains_a)

Cleaned Usernames:
 0           alice
1             bob
2    charlie_data
3           daisy
dtype: object

Contains letter 'a':
 0     True
1    False
2     True
3     True
dtype: bool